music_app/app/views/albums/new.html.erb

            <option value="default" selected disabled> --Select Band--</option>
            <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"