music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Los Fuego Pollo Locos"], ["updated_at", "2022-03-15 19:16:07.795836"], ["id", 1]]
---
    def update
        @band = Band.find(params[:id])
        @band.update(band_params)